# GetShapeType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTray..::..GetShapeType Method
CableTray Class See Also
---
Returns the shape type for the cable tray.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CableTrayShape GetShapeType()
```

Visual Basic
---
```text
Public Function GetShapeType As CableTrayShape
```

Visual C++
---
```text
public:
CableTrayShape GetShapeType()
```

# ### Return Value
The shape type.
# See Also
CableTray Class
Autodesk.Revit.DB.Electrical Namespace